### 4. 데이터프레임 데이터 조작

In [119]:
import numpy as np 
import pandas as pd

- 데이터 갯수 세기

In [120]:
# np.random.seed(2)
# df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
# df.iloc[2,3] = np.nan
# df

In [121]:
# df.count()

In [122]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [123]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- 연습 문제 4.4.1

In [124]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [125]:
# 열 별로 센다
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [126]:
titanic['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

- 정렬

In [171]:
np.random.seed = 2023
df = pd.DataFrame(np.random.randint(40, 101, size=(4,5)), 
                    columns=list('VWXYZ'), index=list('abcd') )
df.V.b = df.V.d
df

    V   W   X   Y   Z
a  60  66  63  62  83
b  95  77  50  48  66
c  75  67  72  56  93
d  95  99  61  83  69

In [172]:
df['V'].sort_values(ascending=False)

b    95
d    95
c    75
a    60
Name: V, dtype: int32

In [173]:
df.sort_values('V')

    V   W   X   Y   Z
a  60  66  63  62  83
c  75  67  72  56  93
b  95  77  50  48  66
d  95  99  61  83  69

In [174]:
df.sort_values(by='V', ascending=False)

    V   W   X   Y   Z
b  95  77  50  48  66
d  95  99  61  83  69
c  75  67  72  56  93
a  60  66  63  62  83

In [175]:
# V 열에 동일한 값이 있으면, 동일한 값은 X 열을 보고 정렬
df.sort_values(by=['V', 'X'], ascending=False)

    V   W   X   Y   Z
d  95  99  61  83  69
b  95  77  50  48  66
c  75  67  72  56  93
a  60  66  63  62  83

- 연습 문제 4.4.2

In [133]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [134]:
print(titanic['sex'].value_counts())

sex
male      577
female    314
Name: count, dtype: int64

In [135]:
titanic['age'].value_counts()

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [136]:
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [178]:
titanic['class'].value_counts().sort_index()

class
First     216
Second    184
Third     491
Name: count, dtype: int64

In [137]:
titanic['alive'].value_counts()

alive
no     549
yes    342
Name: count, dtype: int64

- 행/열 합계

In [183]:
df

    V   W   X   Y   Z
a  60  66  63  62  83
b  95  77  50  48  66
c  75  67  72  56  93
d  95  99  61  83  69

In [223]:
df.iloc[:, :].mean(axis=0)

V    81.25
W    77.25
X    61.50
Y    62.25
Z    77.75
dtype: float64

In [139]:
# 행 방향(열의 합계)
df.sum(axis=0)

V    224
W    300
X    216
Y    306
Z    288
dtype: int64

In [140]:
# 열 방향(행의 합계)
df.sum(axis=1)

a    394
b    309
c    280
d    351
dtype: int64

In [141]:
# 총점 열 만들기
df['총점'] = df.sum(axis=1)
df

    V    W   X   Y   Z   총점
a  74  100  49  94  77  394
b  46   62  46  59  96  309
c  58   41  44  80  57  280
d  46   97  77  73  58  351

In [142]:
# 평균 열 만들기
df['평균'] = df[['V', 'W', 'X', 'Y', 'Z']].mean(axis=1)
df

    V    W   X   Y   Z   총점    평균
a  74  100  49  94  77  394  78.8
b  46   62  46  59  96  309  61.8
c  58   41  44  80  57  280  56.0
d  46   97  77  73  58  351  70.2

In [143]:
df['평균'] = df.iloc[:, :5].mean(axis=1)
df

    V    W   X   Y   Z   총점    평균
a  74  100  49  94  77  394  78.8
b  46   62  46  59  96  309  61.8
c  58   41  44  80  57  280  56.0
d  46   97  77  73  58  351  70.2

- 연습 문제 4.4.3

In [144]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [145]:
# 평균 나이
titanic['age'].mean().round(1)

29.7

In [146]:
# 여성 승객의 평균 나이
titanic[titanic.sex=='female']['age'].mean().round(1)

27.9

In [147]:
# 1등실 선실의 여성 승객의 평균 나이
titanic[(titanic['class']=='First') & (titanic.sex=='female')].age.mean().round(1)
# titanic[(titanic.pclass==1) & (titanic.sex=='female')].age.mean().round(1)

34.6

- apply 변환

In [148]:
titanic.apply(lambda x: x.count())

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [149]:
df2

    V    W   X   Y   Z
a  74  100  49  94  77
c  58   41  44  80  57
d  46   97  77  73  58
b  46   62  46  59  96

In [150]:
# 각 열에서 최대값 - 최소값 한 결과
df2.apply(lambda x: x.max() - x.min())  # x는 각 column을 의미

V    28
W    59
X    33
Y    35
Z    39
dtype: int32

In [151]:
# V 열에서 제곱수
df2.V.apply(lambda x: x * x)    # x는 한 컬럼의 원소를 의미

a    5476
c    3364
d    2116
b    2116
Name: V, dtype: int64

In [152]:
# 타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열

titanic['adult/child'] = titanic.age.apply(lambda x: 'adult' if x >= 20 else 'child')
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [153]:
data = { 
    'price' : ['1,200', '2,500', '3,300'],
    'text' : ['03.입출력.ipynb', '04.고급인덱싱.ipynb', '05.데이터조작.ipynb']
    }
df3 = pd.DataFrame(data)
df3

   price            text
0  1,200    03.입출력.ipynb
1  2,500  04.고급인덱싱.ipynb
2  3,300  05.데이터조작.ipynb

In [154]:
int('1,200'.replace(',', ''))

1200

In [155]:
df3['정수'] = df3.price.apply(lambda x: int(x.replace(',','')))
df3

   price            text    정수
0  1,200    03.입출력.ipynb  1200
1  2,500  04.고급인덱싱.ipynb  2500
2  3,300  05.데이터조작.ipynb  3300

In [156]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.', ''))
df3

   price            text    정수         구둣점제거
0  1,200    03.입출력.ipynb  1200    03입출력ipynb
1  2,500  04.고급인덱싱.ipynb  2500  04고급인덱싱ipynb
2  3,300  05.데이터조작.ipynb  3300  05데이터조작ipynb

In [157]:
# df3['한글제거'] = df3.구둣점제거.apply(lambda x: x.replace(pat=r'[ㄱ-ㅎㅏ-ㅣ가-힣]',repl=r'', regex=True))
# df3

- 연습 문제 4.4.4

In [158]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

In [159]:
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else 'child', axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male